//模型定义
module decoder_3_8(
    a,
    b,
    c,
    out
);
    //定义信号变量，注意输出需要为 reg等类型
      input a;       
      input b;              
      input c;            
      output reg [7:0] out;
    
    //通过三个输入的二进制输入拼接，可以组成八种模式，输出端用二进制的方式表示（b），1对应亮，0对应灭，此处也可以用八进制o，十进制d十六进制h等混合表示
    //二进制更直观的表现变化映射关系
    always@(*)
        case({a,b,c})
            3'b000: out = 8'b0000_0001; 
            3'b001: out = 8'b0000_0010;    
            3'b010: out = 8'b0000_0100;    
            3'b011: out = 8'b0000_1000;    
            3'b100: out = 8'b0001_0000;    
            3'b101: out = 8'b0010_0000;    
            3'b110: out = 8'b0100_0000;    
            3'b111: out = 8'b1000_0000;       
        endcase
        
endmodule


